
'-------------------
'範例1
'建立新的活頁簿
'-------------------

Sub 新增活頁簿()
    Workbooks.Add
End Sub

'---------------------------------------------
'範例2
'開啟指定資料夾中的活頁簿
'
'(請任意變更磁碟代號來執行)
'---------------------------------------------

Sub 開啟活頁簿()
    Workbooks.Open Filename:="C:\Excel2003VBA基礎篇\Dummy.xls"
End Sub

'----------------------------------------------------------------------------------------------
'範例3
'從預設資料夾中開啟活頁簿
'
'(請將「Excel2003基礎篇」資料夾設定為預設資料夾來執行)
'----------------------------------------------------------------------------------------------

Sub 開啟活頁簿2()
    Workbooks.Open Filename:="Dummy.xls"
End Sub

'-------------------
'範例4
'關閉所有活頁簿
'-------------------

Sub 關閉活頁簿()
    Workbooks.Close
End Sub

'-----------------------
'範例5
'關閉使用中的活頁簿
'-----------------------

Sub 關閉活頁簿2()
    ActiveWorkbook.Close
End Sub

'--------------------------------------------
'範例6
'關閉特定的活頁簿
'
'(請開啟「Dummy.xls」後再執行)?????
'---------------------------------------------

Sub 關閉活頁簿3()
    Workbooks("Dummy.xls").Close
End Sub

'-----------------------------------------
'範例7
'關閉第幾個活頁簿
'
'(請開啟兩個以上的活頁簿來執行)
'-----------------------------------------

Sub 關閉活頁簿4()
    Workbooks(2).Close
End Sub
